import React from 'react'
import success from '../../../assets/icons/success.png'

function Success_Credit_Modal() {
  return (
    <div className='success_credit_modal w-full md:w-2/3 h-full flex flex-col justify-center items-center gap-y-8'>
      <div className='img_success w-full flex flex-col justify-center items-center space-y-4 mb-6'>
        <img src={success} className='md:w-[108px] object-contain' alt="" />
        <span className='text-green-600 text-lg'>ثبت موفق</span>
      </div>
      <div className='content_success w-full flex flex-col justify-center items-center space-y-8'>
        <div className='head_conetnt-success flex flex-row items-center justify-center gap-x-6'>
          <div className='manage-point text-sm md:text-[16px] w-[150px] md:w-[182px] bg-secondary-10 px-4 md:px-2 text-center py-3 rounded-lg text-secondary-3'>
            ۱.۰۰۰.۰۰۰.۰۰۰ امتیاز
          </div>

          <svg xmlns="http://www.w3.org/2000/svg" width="25" height="24" viewBox="0 0 25 24" fill="none">
            <g clip-path="url(#clip0_7035_3914)">
              <path d="M0.603341 16.582L4.03146 13.291C4.12701 13.1934 4.24203 13.1151 4.3697 13.0609C4.49736 13.0068 4.63506 12.9778 4.77462 12.9757C4.91419 12.9736 5.05276 12.9985 5.18212 13.0488C5.31147 13.0992 5.42897 13.1739 5.52763 13.2687C5.62629 13.3635 5.7041 13.4764 5.75645 13.6006C5.80879 13.7248 5.8346 13.8578 5.83233 13.9918C5.83006 14.1258 5.79977 14.258 5.74326 14.3805C5.68674 14.503 5.60515 14.6134 5.50334 14.705L3.11792 16.999C4.41466 17.0019 5.69888 16.7556 6.89497 16.2747C8.09106 15.7939 9.17484 15.0881 10.0825 14.199C10.1833 14.1099 10.3017 14.0412 10.4307 13.9968C10.5597 13.9525 10.6967 13.9335 10.8335 13.941C10.9703 13.9484 11.1041 13.9822 11.2271 14.0403C11.35 14.0983 11.4595 14.1795 11.5492 14.279L11.5627 14.299C11.7378 14.4946 11.8275 14.7476 11.8129 15.0051C11.7984 15.2626 11.6807 15.5048 11.4846 15.681C10.391 16.7427 9.08701 17.5833 7.64947 18.1532C6.21194 18.7231 4.67003 19.0107 3.1148 18.999L5.50334 21.292C5.61218 21.3819 5.70049 21.4924 5.76273 21.6166C5.82498 21.7408 5.85981 21.876 5.86504 22.0137C5.87028 22.1514 5.8458 22.2887 5.79315 22.4169C5.74049 22.5452 5.6608 22.6615 5.55907 22.7588C5.45734 22.856 5.33577 22.932 5.20199 22.982C5.06821 23.032 4.92511 23.055 4.78167 23.0493C4.63823 23.0437 4.49754 23.0097 4.36844 22.9494C4.23934 22.8892 4.12461 22.8039 4.03146 22.699L0.603341 19.408C0.213414 19.0331 -0.00558853 18.5249 -0.00558853 17.995C-0.00558853 17.4652 0.213414 16.957 0.603341 16.582Z" fill="#A3822F" />
              <path d="M3.11813 6.99959L5.50354 9.28959C5.52384 9.31592 5.54262 9.34329 5.55979 9.37159C5.72788 9.56835 5.81079 9.81958 5.79137 10.0734C5.77195 10.3271 5.65169 10.5641 5.45544 10.7351C5.2592 10.9062 5.00199 10.9983 4.737 10.9924C4.472 10.9866 4.21949 10.8832 4.03167 10.7036L2.25458 8.99959L0.602503 7.41459C0.323187 7.14435 0.130018 6.80319 0.0456924 6.43119C-0.0386333 6.0592 -0.0106125 5.67183 0.126463 5.31459C0.227665 5.04114 0.390577 4.79254 0.603546 4.58659L4.03167 1.29959C4.12676 1.2004 4.24177 1.1207 4.36978 1.06526C4.49778 1.00983 4.63614 0.979814 4.77653 0.977021C4.91693 0.974229 5.05646 0.998717 5.18675 1.04901C5.31704 1.09931 5.43538 1.17438 5.53468 1.2697C5.63398 1.36502 5.71217 1.47864 5.76456 1.60371C5.81695 1.72879 5.84246 1.86274 5.83955 1.99752C5.83665 2.1323 5.80538 2.26512 5.74763 2.38801C5.68989 2.51089 5.60686 2.6213 5.50354 2.71259L3.115 5.00459C8.25354 5.01659 11.0702 7.67859 13.6244 10.4786C15.9702 7.93659 18.7504 5.39959 23.4514 5.04559L23.9525 4.99959C24.2287 4.99959 24.4937 5.10495 24.689 5.29249C24.8844 5.48002 24.9941 5.73438 24.9941 5.99959C24.9888 6.26321 24.8773 6.5146 24.6831 6.70104C24.4889 6.88747 24.2271 6.99447 23.9525 6.99959C23.8775 6.99959 23.6535 7.03259 23.6535 7.03259C19.5952 7.32759 17.266 9.52159 15.0004 11.9996C17.2525 14.4656 19.566 16.6996 23.591 16.9596L24.0077 16.9806C24.2819 16.997 24.538 17.1174 24.7198 17.3151C24.9016 17.5129 24.9941 17.7719 24.977 18.0351C24.9598 18.2983 24.8345 18.5442 24.6285 18.7187C24.4225 18.8932 24.1527 18.982 23.8785 18.9656C23.716 18.9586 23.4514 18.9526 23.3212 18.9426C18.0921 18.5556 15.2556 15.3426 12.7264 12.5336C10.1723 9.69959 7.75979 7.01759 3.11813 6.99959Z" fill="#A3822F" />
            </g>
            <defs>
              <clipPath id="clip0_7035_3914">
                <rect width="25" height="24" fill="white" transform="matrix(-1 0 0 1 25 0)" />
              </clipPath>
            </defs>
          </svg>

          <div className='manage-point text-sm md:text-[16px] w-[150px] md:w-[182px] bg-green-100/80 text-center px-4 md:px-2 py-3 rounded-lg text-green-600'>
            ۱۰۰۰ واحد
          </div>
        </div>

        <div className='content_success_data flex flex-col space-y-2 text-neutral-500'>
          <div className='flex flex-row justify-between items-center space-y-4'>
            <span className='text-sm'>شماره درخواست</span>
            <span className='text-sm'>۳۶۳۴۷۲۷۸۷</span>
          </div>
          <div className='flex flex-row justify-between items-center space-y-4'>
            <span className='text-sm'>شماره درخواست</span>
            <span className='text-sm'>۳۶۳۴۷۲۷۸۷</span>
          </div>
          <p className='text-sm leading-8'>امتیاز مورد نظر کسر شده و درخواست در کارگزاری ثبت گردید. پس از تایید نهایی توسط کارشناس مربوطه، مبلغ اعتبار به قدرت خرید شما در کارگزاری بانک آینده افزوده خواهد شد.
          </p>
        </div>
      </div>
      <button className='w-[125px] text-[16px] py-1.5 border-1 border-secondary-2 text-secondary-2 rounded-md cursor-pointer'>مشاهده</button>
    </div>
  )
}

export default Success_Credit_Modal